<div class="b-pure-content">
						<h4><strong>Продукты </strong><strong>Embarcadero</strong> <strong>для образования: </strong><strong>Delphi</strong><strong>, </strong><strong>C</strong><strong>++</strong><strong>Builder</strong><strong> и </strong><strong>RAD</strong> <strong>studio</strong></h4>

<p><strong>Компании </strong><strong>Softline</strong><strong> и Embarcadero проводят программу по поддержке учебных заведений. Целью программы является предоставление доступа к средствам разработки </strong><strong>Embarcadero</strong><strong>&nbsp;–&nbsp;</strong><strong>RAD</strong> <strong>Studio</strong><strong>, </strong><strong>Delphi</strong><strong> и </strong><strong>C</strong><strong>++</strong><strong>Builder</strong><strong>, а также к учебным материалам по этим продуктам. </strong></p>

<p>Компания Embarcadero заинтересована в обучении разработчиков во всех странах мира. Преподаватели на различных ступенях образования — от средних школ до университетов — пользуются инструментами Embarcadero для обучения, а также документацией и книгами, чтобы вдохновить новое поколение специалистов по вычислительным системам, открывая всем ученикам мир возможностей в области естественных наук, технологий, инженерии и математики.</p>

<p><strong>Какой язык программирования следует преподавать?</strong></p>

<p>Любой язык из этого набора —&nbsp;C++ или Delphi&nbsp;—&nbsp;даст ученикам возможность познакомиться с основами, которые применяются во всех языках программирования, и подготовит их к выходу на профессиональный уровень.</p>

<p><strong>Delphi</strong></p>

<p>При обучении программированию необходимо использовать простой язык, который является ясным и понятным, а также не скрывает основополагающие и важные принципы программирования компьютерных систем. Именно таким языком является Delphi — это современный, мощный объектно-ориентированный язык, созданный на базе простого языка Pascal. Этот язык позволяет обучать правильному мышлению при разработке программного обеспечения и оптимальным практическим приемам работы. Ясность языка Delphi гарантирует глубину понимания в процессе обучения. К тому же именно Delphi профессионально используется в тысячах широко известных приложений крупных поставщиков программного обеспечения для операционных систем Windows, macOS, iOS, Android и Linux.</p>

<p><strong>C++</strong></p>

<p>На сегодняшний день C++ — это язык, который наиболее широко применяется при разработке системных приложений, формирующих основу операционных систем, игр и сотен корпоративных приложений. C++Builder предлагает самую совершенную современную платформу для изучения C++ в среде с самым высоким уровнем визуализации. Разработчики могут не только создавать и компилировать код с использованием лучшей в своем классе интегрированной среды разработки и технологии, но также разрабатывать высококачественные графические интерфейсы, способные работать на различных устройствах, на базе одного и того же исходного кода.</p>

<p><strong>Для школ</strong></p>

<p>Образовательные программы Embarcadero позволяют получить лицензии Delphi и C++Builder, которые можно использовать в целях обучения программированию. Такие лицензии могут быть развернуты в учебных классах школы. &nbsp;Есть два варианта получения программ:</p>

<p><span style="font-weight: 700;">1. Бесплатные образовательные лицензии —&nbsp;RAD Studio Professional</span></p>

<p>В рамках программы школа или университет может бесплатно получить необходимое количество лицензий RAD Studio Professional&nbsp;для использования в учебных классах. Тип лицензии —&nbsp;Concurrent (лицензия на одновременный доступ, без привязки к конкретным именам учащихся). Срок действия —&nbsp;один год. По истечении года лицензии можно заказать повторно. Обратитесь к нашим менеджерам для запроса условий участия.</p>

<p><strong>2. Платные образовательные лицензии —&nbsp;RAD Studio Architect</strong></p>

<p>Если функционала редакции Professional недостаточно, то в рамках программы вы можете приобрести образовательные лицензии на RAD Studio Architect (<a href="https://store.softline.ru/embarcadero/embarcadero-rad-studio-academic/">https://store.softline.ru/embarcadero/embarcadero-rad-studio-academic/</a>). Такие лицензии предоставляются сроком на один год, после чего их следует приобрести повторно. Возможна покупка сразу на несколько лет. Вы можете обратиться к нашим менеджерам за расчетом стоимости.</p>

<p><strong>Для учащихся </strong></p>

<p>Для выполнения домашних работ студенты могут самостоятельно скачать и установить на свои личные компьютеры Delphi и C++Builder в &nbsp;редакции Community Edition:</p>

<p><a href="https://www.embarcadero.com/products/delphi/starter" target="_blank">https://www.embarcadero.com/products/delphi/starter</a>;</p>

<p><a href="https://www.embarcadero.com/products/cbuilder/starter" target="_blank">https://www.embarcadero.com/products/cbuilder/starter</a>. &nbsp;&nbsp;&nbsp;</p>

<p>По своим функциональным возможностям редакция Community Edition практически аналогична редакции Professional. Хотя редакция Delphi Community Edition предоставляется бесплатно, ее использование требует соблюдения условий лицензионного соглашения. Лицензия представляет собой ограниченную коммерческую лицензию. Использование ее в компаниях, организациях и учреждениях недопустимо. Частные лица могут использовать ее либо для некоммерческой разработки, либо для коммерческой до получения дохода от любых видов деятельности, связанных с Community Edition, в размере не более $5000. Таким образом, использование Community Edition на компьютерах учебного заведения невозможно. Для получения и установки лицензий в компьютерные классы школы следует воспользоваться предложениями, указанными в разделе «Для школ».</p>

<p>Для домашних работ учащиеся могут воспользоваться книгой Всеволода Леонова «Обучение мобильной разработке на Delphi», а также многочисленными учебными материалами образовательного сайта <a href="https://learndelphi.org/" target="_blank">https://learndelphi.org/</a> . <strong>&nbsp;&nbsp;</strong></p>

<p><strong>Для учителей</strong></p>

<p>Учителя могут скачать и установить на свои домашние компьютеры лицензии Delphi и C++Builder в редакции Community Edition:</p>

<p><a href="https://www.embarcadero.com/products/delphi/starter" target="_blank">https://www.embarcadero.com/products/delphi/starter</a>; &nbsp;</p>

<p><a href="https://www.embarcadero.com/products/cbuilder/starter" target="_blank">https://www.embarcadero.com/products/cbuilder/starter</a>.</p>

<p>Для работы в школе при подготовке учебных и методических материалов можно использовать школьные образовательные лицензии, описанные в разделе «Для школ». Учителя также могут пользоваться материалами информационными и методическими материалами образовательного сайта <a href="https://learndelphi.org/" target="_blank">https://learndelphi.org/</a> <strong>,</strong> а также книгой «Обучение мобильной разработке на Delphi».</p>

<p><strong>Подробнее о лицензиях</strong></p>

<p>Компания Embarcadero предлагает продукты RAD Studio с образовательной лицензией Academic, которая доступна для аккредитованных учебных заведений, желающих включить обучение RAD Studio в свою учебную программу.</p>

<p>Версия Academic эквивалентна RAD Studio версии Enterprise, включая языки Delphi (Object Pascal) и C ++, а также включает в себя поддержку доступа к базе данных клиент/сервер, многоуровневую разработку приложений с использованием RAD Server и DataSnap и дополнительные возможности помимо тех, которые представлены в версиях Professional или Community.</p>

<p>Версия Community ограничивается возможностью пяти установок в одной сети, в то время как версия Academic лишена данного ограничения. Студентам предлагается устанавливать Community Edition дома (бесплатно). Обращаем ваше внимание на то, что образовательные лицензии могут быть использованы только в целях обучения программированию. Любая разработка, в том числе коммерческая, некоммерческая, научная или выполнение внутренних разработок по автоматизации школы/университета с помощью этих лицензий являются нарушением лицензионного соглашения и авторских прав компании Embarcadero. &nbsp;</p>

<p><strong>Задайте вопрос или запросите дополнительную информацию о решениях Embarcadero для образования у наших менеджеров, заполнив форму обратной связи:</strong></p>
					</div>